{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 60, 126], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_31"}, "name": "input_31", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_69", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_69", "inbound_nodes": [[["input_31", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_49", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_49", "inbound_nodes": [["dense_69", 0, 0, {"y": [[[0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0, 0.0, 1.0], [0.8414709568023682, 0.5403022766113281, 0.7617204189300537, 0.6479058861732483, 0.6815613508224487, 0.7317609786987305, 0.6046940088272095, 0.7964578866958618, 0.5331684350967407, 0.8460091352462769, 0.4679480791091919, 0.8837559819221497, 0.40930891036987305, 0.9123958349227905, 0.35711193084716797, 0.934061586856842, 0.3109835982322693, 0.9504152536392212, 0.2704322338104248, 0.9627389907836914, 0.23492108285427094, 0.9720144271850586, 0.20391227304935455, 0.9789891839027405, 0.17689219117164612, 0.9842302203178406, 0.1533847451210022, 0.9881665706634521, 0.13295726478099823, 0.991121768951416, 0.11522171646356583, 0.9933397769927979, 0.0998334139585495, 0.9950041770935059, 0.08648823946714401, 0.9962528944015503, 0.07491915673017502, 0.9971895813941956, 0.06489253044128418, 0.9978922605514526, 0.05620449781417847, 0.9984192848205566, 0.048677507787942886, 0.9988145232200623, 0.04215715453028679, 0.999110996723175, 0.03650929778814316, 0.9993333220481873, 0.031617507338523865, 0.999500036239624, 0.027380773797631264, 0.9996250867843628, 0.023711513727903366, 0.9997188448905945, 0.020533807575702667, 0.9997891783714294, 0.017781857401132584, 0.9998418688774109, 0.015398656949400902, 0.9998814463615417, 0.013334819115698338, 0.9999110698699951, 0.011547563597559929, 0.9999333024024963, 0.009999833069741726, 0.9999499917030334, 0.008659535087645054, 0.9999625086784363, 0.007498872000724077, 0.999971866607666, 0.006493770517408848, 0.9999788999557495, 0.0056233834475278854, 0.9999842047691345, 0.0048696561716496944, 0.9999881386756897, 0.0042169527150690556, 0.9999911189079285, 0.0036517330445349216, 0.9999933242797852, 0.003162272274494171, 0.9999949932098389, 0.0027384161949157715, 0.9999962449073792, 0.002371371490880847, 0.9999971985816956, 0.0020535236690193415, 0.9999979138374329, 0.00177827849984169, 0.9999983906745911, 0.0015399259282276034, 0.9999988079071045, 0.0013335209805518389, 0.9999991059303284, 0.00115478178486228, 0.9999993443489075, 0.0009999998146668077, 0.9999995231628418, 0.0008659642189741135, 0.9999996423721313, 0.0007498941267840564, 0.9999997019767761, 0.0006493816035799682, 0.9999997615814209, 0.000562341301701963, 0.9999998211860657, 0.00048696750309318304, 0.9999998807907104, 0.00042169648804701865, 0.9999999403953552, 0.00036517411353997886, 0.9999999403953552, 0.0003162277571391314, 0.9999999403953552, 0.00027384195709601045, 0.9999999403953552, 0.00023713737027719617, 1.0, 0.00020535249495878816, 1.0, 0.00017782794020604342, 1.0, 0.00015399264520965517, 1.0, 0.00013335213589016348, 1.0, 0.00011547820031410083, 1.0], [0.9092974066734314, -0.416146844625473, 0.9870462417602539, -0.16043595969676971, 0.9974799752235413, 0.07094825059175491, 0.9632266163825989, 0.268690288066864, 0.9021307229995728, 0.431462824344635, 0.8271037936210632, 0.5620492100715637, 0.7469035387039185, 0.6649324297904968, 0.6671290993690491, 0.7449421286582947, 0.5911270976066589, 0.8065783977508545, 0.5207113027572632, 0.8537328243255615, 0.4566933512687683, 0.8896241784095764, 0.39925581216812134, 0.916839599609375, 0.3482052683830261, 0.9374182820320129, 0.3031393587589264, 0.9529462456703186, 0.2635536789894104, 0.964644730091095, 0.22890862822532654, 0.9734479188919067, 0.19866932928562164, 0.9800665974617004, 0.17232832312583923, 0.9850395917892456, 0.1494172066450119, 0.9887742400169373, 0.1295115053653717, 0.9915779232978821, 0.1122313141822815, 0.9936820864677429, 0.09723960608243942, 0.995261013507843, 0.08423934876918793, 0.9964455366134644, 0.07296991348266602, 0.9973341226577759, 0.06320339441299438, 0.9980006814002991, 0.054741017520427704, 0.9985005855560303, 0.04740969464182854, 0.9988754987716675, 0.04105895385146141, 0.9991567134857178, 0.03555808961391449, 0.9993675947189331, 0.03079366125166416, 0.999525785446167, 0.026667267084121704, 0.9996443390846252, 0.023093586787581444, 0.9997333288192749, 0.019998665899038315, 0.9998000264167786, 0.017318420112133026, 0.9998500347137451, 0.014997322112321854, 0.9998875260353088, 0.012987267225980759, 0.9999156594276428, 0.01124658901244402, 0.9999367594718933, 0.009739196859300137, 0.9999525547027588, 0.008433829993009567, 0.9999644160270691, 0.007303417660295963, 0.9999733567237854, 0.006324513349682093, 0.9999799728393555, 0.005476811900734901, 0.9999849796295166, 0.004742729477584362, 0.9999887347221375, 0.004107038490474224, 0.9999915957450867, 0.0035565514117479324, 0.9999936819076538, 0.0030798481311649084, 0.999995231628418, 0.002667039632797241, 0.9999964237213135, 0.002309561939910054, 0.9999973177909851, 0.0019999986980110407, 0.9999979734420776, 0.001731927739456296, 0.9999985098838806, 0.0014997879043221474, 0.9999988675117493, 0.001298762857913971, 0.9999991655349731, 0.0011246823705732822, 0.9999993443489075, 0.0009739348897710443, 0.9999995231628418, 0.0008433929178863764, 0.9999996423721313, 0.0007303481688722968, 0.9999997615814209, 0.0006324555142782629, 0.9999998211860657, 0.0005476839141920209, 0.9999998211860657, 0.0004742747114505619, 0.9999998807907104, 0.0004107049899175763, 0.9999999403953552, 0.00035565588041208684, 0.9999999403953552, 0.00030798529041931033, 0.9999999403953552, 0.00026670427178032696, 0.9999999403953552, 0.00023095640062820166, 1.0], [0.14112000167369843, -0.9899924993515015, 0.5173057317733765, -0.8558006882667542, 0.7782725095748901, -0.6279266476631165, 0.9296448230743408, -0.3684568703174591, 0.9932531714439392, -0.11596614122390747, 0.9939677715301514, 0.10967269539833069, 0.9536344408988953, 0.3009673058986664, 0.8891674280166626, 0.4575820565223694, 0.8126488924026489, 0.582753598690033, 0.732185959815979, 0.6811047792434692, 0.6529040336608887, 0.7574406862258911, 0.5778219699859619, 0.8161628246307373, 0.508536159992218, 0.8610406517982483, 0.4457195997238159, 0.895172655582428, 0.38947030901908875, 0.9210390448570251, 0.3395463824272156, 0.9405893087387085, 0.29552021622657776, 0.9553365111351013, 0.2568769156932831, 0.9664441347122192, 0.22307541966438293, 0.9748011827468872, 0.19358453154563904, 0.9810835719108582, 0.16790330410003662, 0.985803484916687, 0.14557115733623505, 0.9893477559089661, 0.1261717677116394, 0.99200838804245, 0.10933323204517365, 0.9940051436424255, 0.0947260931134224, 0.9955033659934998, 0.08206021040678024, 0.9966273903846741, 0.07108122110366821, 0.9974705576896667, 0.0615667887032032, 0.9981029629707336, 0.05332307890057564, 0.9985772967338562, 0.046181365847587585, 0.9989330768585205, 0.0399949736893177, 0.9991998672485352, 0.03463653102517128, 0.9993999600410461, 0.029995501041412354, 0.9995500445365906, 0.02597600780427456, 0.9996625781059265, 0.022494928911328316, 0.9997469782829285, 0.01948021724820137, 0.9998102188110352, 0.01686943881213665, 0.9998577237129211, 0.014608506113290787, 0.999893307685852, 0.012650557793676853, 0.9999199509620667, 0.010955004952847958, 0.9999399781227112, 0.00948669109493494, 0.9999549984931946, 0.008215166628360748, 0.9999662637710571, 0.007114061154425144, 0.9999746680259705, 0.00616053631529212, 0.9999810457229614, 0.005334813147783279, 0.9999857544898987, 0.004619763232767582, 0.9999893307685852, 0.004000553395599127, 0.9999920129776001, 0.003464339068159461, 0.9999939799308777, 0.0029999956022948027, 0.9999955296516418, 0.00259789009578526, 0.9999966025352478, 0.002249680692330003, 0.9999974966049194, 0.0019481437047943473, 0.9999980926513672, 0.0016870232066139579, 0.9999985694885254, 0.0014609020436182618, 0.999998927116394, 0.001265089143998921, 0.9999992251396179, 0.0010955221951007843, 0.9999994039535522, 0.0009486831841059029, 0.9999995231628418, 0.0008215258130803704, 0.9999996423721313, 0.0007114120526239276, 0.9999997615814209, 0.0006160574848763645, 0.9999998211860657, 0.000533483806066215, 0.9999998807907104, 0.0004619779356289655, 0.9999998807907104, 0.00040005642222240567, 0.9999999403953552, 0.0003464345936663449, 0.9999999403953552], [-0.756802499294281, -0.6536436080932617, -0.31671541929244995, -0.9485206007957458, 0.14153891801834106, -0.9899327158927917, 0.5176193118095398, -0.8556110262870789, 0.7784717679023743, -0.6276796460151672, 0.9297460317611694, -0.3682014048099518, 0.9932807087898254, -0.11572977900505066, 0.9939451217651367, 0.10987751185894012, 0.9535807371139526, 0.3011374771595001, 0.8890966773033142, 0.45771944522857666, 0.8125709295272827, 0.582862377166748, 0.7321070432662964, 0.6811895966529846, 0.6528279781341553, 0.7575061917304993, 0.5777510404586792, 0.816213071346283, 0.5084713101387024, 0.8610789179801941, 0.4456612467765808, 0.8952016830444336, 0.3894183337688446, 0.9210609793663025, 0.33950042724609375, 0.940605878829956, 0.29547977447509766, 0.9553489685058594, 0.2568415105342865, 0.9664535522460938, 0.2230444848537445, 0.9748082756996155, 0.19355757534503937, 0.9810889363288879, 0.1678798496723175, 0.985807478427887, 0.14555077254772186, 0.9893507957458496, 0.1261540651321411, 0.9920106530189514, 0.10931787639856339, 0.9940068125724792, 0.0947127714753151, 0.99550461769104, 0.08204866200685501, 0.9966283440589905, 0.07107120752334595, 0.997471272945404, 0.06155811622738838, 0.9981034994125366, 0.05331556499004364, 0.9985777139663696, 0.046174854040145874, 0.9989333748817444, 0.03998933359980583, 0.9992001056671143, 0.034631647169589996, 0.9994001388549805, 0.02999127097427845, 0.9995501637458801, 0.02597234398126602, 0.9996626377105713, 0.022491756826639175, 0.9997470378875732, 0.019477469846606255, 0.9998102784156799, 0.016867060214281082, 0.9998577237129211, 0.014606446027755737, 0.999893307685852, 0.01264877337962389, 0.9999200105667114, 0.01095345988869667, 0.999940037727356, 0.009485352784395218, 0.9999549984931946, 0.008214008063077927, 0.9999662637710571, 0.007113057654350996, 0.9999747276306152, 0.006159666925668716, 0.9999810457229614, 0.00533406063914299, 0.9999857544898987, 0.004619111306965351, 0.9999893307685852, 0.003999989479780197, 0.9999920129776001, 0.0034638503566384315, 0.9999939799308777, 0.00299957231618464, 0.9999955296516418, 0.002597523620352149, 0.9999966025352478, 0.0022493633441627026, 0.9999974966049194, 0.001947868848219514, 0.9999980926513672, 0.0016867852536961436, 0.9999985694885254, 0.0014606959884986281, 0.999998927116394, 0.0012649106793105602, 0.9999992251396179, 0.0010953675955533981, 0.9999994039535522, 0.0009485493646934628, 0.9999995231628418, 0.0008214099216274917, 0.9999996423721313, 0.0007113117026165128, 0.9999997615814209, 0.0006159705808386207, 0.9999998211860657, 0.0005334085435606539, 0.9999998807907104, 0.00046191277215257287, 0.9999998807907104], [-0.9589242935180664, 0.28366219997406006, -0.9277092814445496, -0.37330347299575806, -0.57112717628479, -0.8208615779876709, -0.10512092709541321, -0.9944594502449036, 0.32393521070480347, -0.9460792541503906, 0.649369478225708, -0.7604730725288391, 0.858896017074585, -0.5121500492095947, 0.9676445722579956, -0.25231730937957764, 0.9999465346336365, -0.010342318564653397, 0.9797501564025879, 0.20022396743297577, 0.9267573356628418, 0.37566059827804565, 0.8556277751922607, 0.517591655254364, 0.7765299677848816, 0.6300802826881409, 0.696108877658844, 0.7179362177848816, 0.6184437274932861, 0.7858291268348694, 0.5458397269248962, 0.8378896117210388, 0.4794255495071411, 0.8775825500488281, 0.4195796251296997, 0.9077185392379761, 0.3662233054637909, 0.9305269718170166, 0.319015771150589, 0.9477494359016418, 0.2774805426597595, 0.9607312679290771, 0.24108508229255676, 0.9705039858818054, 0.20928944647312164, 0.9778537154197693, 0.1815742403268814, 0.98337721824646, 0.15745589137077332, 0.987525999546051, 0.13649356365203857, 0.9906409382820129, 0.11829106509685516, 0.9929789900779724, 0.102495938539505, 0.994733452796936, 0.08879686146974564, 0.9960497617721558, 0.0769202709197998, 0.9970372319221497, 0.06662667542695999, 0.9977779984474182, 0.05770702287554741, 0.9983335733413696, 0.04997916892170906, 0.9987502694129944, 0.043284688144922256, 0.9990627765655518, 0.03748592734336853, 0.9992971420288086, 0.032463375478982925, 0.9994729161262512, 0.028113361448049545, 0.9996047616004944, 0.024345969781279564, 0.999703586101532, 0.02108326368033886, 0.9997777342796326, 0.018257692456245422, 0.9998332858085632, 0.015810729935765266, 0.999875009059906, 0.013691670261323452, 0.9999062418937683, 0.011856590397655964, 0.9999297261238098, 0.010267444886267185, 0.9999473094940186, 0.008891279809176922, 0.9999604821205139, 0.007699556648731232, 0.9999703764915466, 0.006667557638138533, 0.9999777674674988, 0.00577387772500515, 0.9999833106994629, 0.0049999793991446495, 0.9999874830245972, 0.004329808056354523, 0.9999906420707703, 0.0037494623102247715, 0.9999929666519165, 0.0032469024881720543, 0.9999947547912598, 0.002811702899634838, 0.9999960660934448, 0.0024348353035748005, 0.9999970197677612, 0.002108481014147401, 0.9999977946281433, 0.0018258696654811502, 0.9999983310699463, 0.0015811381163075566, 0.9999987483024597, 0.0013692093780264258, 0.9999990463256836, 0.0011856865603476763, 0.9999992847442627, 0.001026762300170958, 0.999999463558197, 0.0008891395991668105, 0.9999995827674866, 0.0007699631969444454, 0.9999997019767761, 0.0006667606648989022, 0.9999997615814209, 0.0005773909506388009, 0.9999998211860657], [-0.279415488243103, 0.9601702690124512, -0.8854211568832397, 0.46478959918022156, -0.9773961305618286, -0.21141624450683594, -0.6850680708885193, -0.7284790873527527, -0.2303674817085266, -0.9731037020683289, 0.21802224218845367, -0.9759438037872314, 0.574025571346283, -0.8188374042510986, 0.8137340545654297, -0.5812373161315918, 0.9471481442451477, -0.3207964599132538, 0.9973906874656677, -0.07219259440898895, 0.9890720844268799, 0.14743269979953766, 0.9431936144828796, 0.33224359154701233, 0.8757405877113342, 0.4827820062637329, 0.7979919910430908, 0.6026681065559387, 0.7174347043037415, 0.6966257691383362, 0.6387473940849304, 0.7694165110588074, 0.5646424889564514, 0.8253356218338013, 0.49651437997817993, 0.868028461933136, 0.434908390045166, 0.9004747271537781, 0.3798452317714691, 0.9250500798225403, 0.33103933930397034, 0.9436169862747192, 0.28804099559783936, 0.9576180577278137, 0.25032690167427063, 0.9681613445281982, 0.21735559403896332, 0.976092517375946, 0.18860028684139252, 0.9820539355278015, 0.16356690227985382, 0.9865322709083557, 0.1418028473854065, 0.9898949265480042, 0.12289999425411224, 0.9924190640449524, 0.10649443417787552, 0.9943132996559143, 0.09226418286561966, 0.9957345724105835, 0.07992594689130783, 0.9968007802963257, 0.06923149526119232, 0.9976006150245667, 0.059964004904031754, 0.998200535774231, 0.051934484392404556, 0.9986504912376404, 0.04497847333550453, 0.9989879727363586, 0.038953039795160294, 0.999241054058075, 0.03373407945036888, 0.9994308352470398, 0.02921389415860176, 0.9995731711387634, 0.025299090892076492, 0.9996799230575562, 0.021908694878220558, 0.9997599720954895, 0.018972527235746384, 0.9998199939727783, 0.016429778188467026, 0.9998649954795837, 0.014227761887013912, 0.9998987913131714, 0.012320838868618011, 0.9999241232872009, 0.010669473558664322, 0.9999430775642395, 0.009239427745342255, 0.9999573230743408, 0.00800104346126318, 0.9999679923057556, 0.006928636692464352, 0.9999759793281555, 0.0059999641962349415, 0.9999819993972778, 0.005195762496441603, 0.9999865293502808, 0.00449935020878911, 0.9999898672103882, 0.0038962799590080976, 0.9999924302101135, 0.003374041523784399, 0.9999943375587463, 0.002921801060438156, 0.9999957084655762, 0.0025301764253526926, 0.9999967813491821, 0.0021910429932177067, 0.999997615814209, 0.0018973654368892312, 0.9999982118606567, 0.0016430510440841317, 0.9999986290931702, 0.0014228237560018897, 0.9999989867210388, 0.0012321147369220853, 0.9999992251396179, 0.0010669674957171082, 0.9999994039535522, 0.0009239558130502701, 0.9999995827674866, 0.0008001127862371504, 0.9999997019767761, 0.0006928691291250288, 0.9999997615814209], [0.6569865942001343, 0.7539022564888, -0.21962985396385193, 0.9755832552909851, -0.8593134880065918, 0.5114492774009705, -0.9861347675323486, -0.16594631969928741, -0.7137211561203003, -0.7004299163818359, -0.26401257514953613, -0.9645192623138428, 0.18858110904693604, -0.9820576310157776, 0.5525109767913818, -0.8335056304931641, 0.8004216551780701, -0.599437415599823, 0.9407037496566772, -0.3392292261123657, 0.996027410030365, -0.08904716372489929, 0.9911248683929443, 0.13293413817882538, 0.9473307132720947, 0.3202569782733917, 0.8809890747070312, 0.47313663363456726, 0.8036866188049316, 0.5950527787208557, 0.7231467366218567, 0.6906944513320923, 0.6442176699638367, 0.7648422122001648, 0.5697281360626221, 0.8218331933021545, 0.5011489391326904, 0.8653610348701477, 0.43907344341278076, 0.8984511494636536, 0.38355156779289246, 0.9235194325447083, 0.3343140184879303, 0.9424617290496826, 0.29091930389404297, 0.9567475914955139, 0.2528471350669861, 0.9675062298774719, 0.21955609321594238, 0.9755998849868774, 0.1905176043510437, 0.9816837906837463, 0.16523487865924835, 0.9862542152404785, 0.14325222373008728, 0.9896861910820007, 0.1241583377122879, 0.9922624230384827, 0.10758621990680695, 0.9941957592964172, 0.09321099519729614, 0.9956463575363159, 0.08074673265218735, 0.9967346787452698, 0.06994284689426422, 0.9975510239601135, 0.06058038771152496, 0.9981633424758911, 0.05246848985552788, 0.9986225962638855, 0.04544106125831604, 0.9989669919013977, 0.03935372829437256, 0.9992253184318542, 0.03408112749457359, 0.999419093132019, 0.02951446920633316, 0.9995643496513367, 0.025559404864907265, 0.9996733069419861, 0.02213413640856743, 0.9997550249099731, 0.019167764112353325, 0.9998162984848022, 0.016598854213953018, 0.9998622536659241, 0.014374179765582085, 0.9998967051506042, 0.01244763471186161, 0.999922513961792, 0.010779276490211487, 0.999941885471344, 0.00933451484888792, 0.9999564290046692, 0.008083385415375233, 0.9999673366546631, 0.0069999429397284985, 0.9999755024909973, 0.006061713211238384, 0.9999816417694092, 0.005249235313385725, 0.9999862313270569, 0.004545655567198992, 0.9999896883964539, 0.003936379216611385, 0.9999922513961792, 0.003408766118809581, 0.9999942183494568, 0.0029518711380660534, 0.9999956488609314, 0.0025562162045389414, 0.9999967217445374, 0.002213592641055584, 0.9999975562095642, 0.0019168925937265158, 0.999998152256012, 0.0016599608352407813, 0.9999986290931702, 0.0014374670572578907, 0.9999989867210388, 0.0012447952758520842, 0.9999992251396179, 0.0010779483709484339, 0.9999994039535522, 0.0009334648493677378, 0.9999995827674866, 0.0008083473076112568, 0.9999997019767761], [0.9893582463264465, -0.1455000340938568, 0.6008222103118896, 0.7993826866149902, -0.28022801876068115, 0.9599334597587585, -0.885761559009552, 0.46414056420326233, -0.9772617220878601, -0.21203650534152985, -0.6846675872802734, -0.7288554310798645, -0.22990432381629944, -0.973213255405426, 0.21842443943023682, -0.9758538603782654, 0.5743177533149719, -0.8186324834823608, 0.8139137029647827, -0.5809858441352844, 0.9472339749336243, -0.32054296135902405, 0.9974074363708496, -0.07196144014596939, 0.9890424609184265, 0.1476311981678009, 0.9431358575820923, 0.33240753412246704, 0.8756678700447083, 0.4829137921333313, 0.7979134321212769, 0.6027721166610718, 0.7173560857772827, 0.6967067122459412, 0.6386722326278687, 0.7694789171218872, 0.5645726323127747, 0.8253834247589111, 0.4964507818222046, 0.8680648803710938, 0.4348512291908264, 0.9005023241043091, 0.3797943890094757, 0.9250709414482117, 0.3309944272041321, 0.9436327219009399, 0.28800153732299805, 0.957629919052124, 0.2502923607826233, 0.9681702852249146, 0.21732543408870697, 0.9760991930961609, 0.18857400119304657, 0.9820590019226074, 0.16354404389858246, 0.9865360260009766, 0.1417829692363739, 0.9898977875709534, 0.12288274616003036, 0.9924212098121643, 0.1064794734120369, 0.9943149089813232, 0.09225121140480042, 0.995735764503479, 0.07991469651460648, 0.9968017339706421, 0.06922174245119095, 0.9976012706756592, 0.05995555967092514, 0.9982010722160339, 0.05192716419696808, 0.998650848865509, 0.04497213289141655, 0.9989882707595825, 0.03894754871726036, 0.9992412328720093, 0.033729322254657745, 0.9994310140609741, 0.029209773987531662, 0.999573290348053, 0.025295522063970566, 0.9996800422668457, 0.021905604749917984, 0.9997600317001343, 0.018969852477312088, 0.9998200535774231, 0.016427461057901382, 0.9998650550842285, 0.01422575581818819, 0.9998987913131714, 0.012319101020693779, 0.9999241232872009, 0.010667969472706318, 0.9999430775642395, 0.009238124825060368, 0.9999573230743408, 0.007999914698302746, 0.9999679923057556, 0.006927659269422293, 0.9999759793281555, 0.005999117624014616, 0.9999819993972778, 0.00519502954557538, 0.9999865293502808, 0.00449871551245451, 0.9999898672103882, 0.003895730245858431, 0.9999924302101135, 0.0033735656179487705, 0.9999943375587463, 0.0029213889501988888, 0.9999957084655762, 0.0025298194959759712, 0.9999967813491821, 0.002190734026953578, 0.999997615814209, 0.001897097798064351, 0.9999982118606567, 0.0016428192611783743, 0.9999986290931702, 0.00142262305598706, 0.9999989867210388, 0.0012319409288465977, 0.9999992251396179, 0.001066816970705986, 0.9999994039535522, 0.0009238254278898239, 0.9999995827674866], [0.41211849451065063, -0.9111302495002747, 0.9981823563575745, 0.06026618182659149, 0.4491936266422272, 0.8934344053268433, -0.4248087704181671, 0.9052830934524536, -0.9398235082626343, 0.3416603207588196, -0.9461455941200256, -0.32374146580696106, -0.608108639717102, -0.7938538193702698, -0.14446718990802765, -0.9895095825195312, 0.29125910997390747, -0.9566441774368286, 0.6264691352844238, -0.7794461846351624, 0.8454228043556213, -0.5340976119041443, 0.9617772102355957, -0.2738330662250519, 0.9995602965354919, -0.029650796204805374, 0.9829615354537964, 0.18381133675575256, 0.9321004152297974, 0.36219996213912964, 0.8620516061782837, 0.506820559501648, 0.7833269238471985, 0.6216099858283997, 0.702829897403717, 0.7113579511642456, 0.6248229742050171, 0.7807664275169373, 0.5517352819442749, 0.8340192437171936, 0.4847761392593384, 0.8746382594108582, 0.4243743121623993, 0.9054868817329407, 0.37048104405403137, 0.9288400411605835, 0.32277193665504456, 0.9464767575263977, 0.28077834844589233, 0.9597726464271545, 0.24397030472755432, 0.9697827100753784, 0.21180708706378937, 0.9773114919662476, 0.1837669014930725, 0.9829698204994202, 0.1593627780675888, 0.9872201085090637, 0.13815012574195862, 0.9904112815856934, 0.11972901225090027, 0.992806613445282, 0.10374338179826736, 0.9946041107177734, 0.08987855166196823, 0.9959527254104614, 0.07785791158676147, 0.9969644546508789, 0.0674392580986023, 0.997723400592804, 0.05841108039021492, 0.9982926249504089, 0.05058911442756653, 0.9987195730209351, 0.04381304979324341, 0.9990397691726685, 0.03794357553124428, 0.9992798566818237, 0.03285975381731987, 0.999459981918335, 0.028456656262278557, 0.999595046043396, 0.02464328147470951, 0.9996963143348694, 0.021340742707252502, 0.9997722506523132, 0.01848067343235016, 0.9998292326927185, 0.01600383222103119, 0.9998719096183777, 0.013858894817531109, 0.9999039769172668, 0.012001404538750648, 0.9999279975891113, 0.010392851196229458, 0.9999459981918335, 0.008999878540635109, 0.9999595284461975, 0.007793600205332041, 0.9999696016311646, 0.006748996675014496, 0.9999772310256958, 0.005844401195645332, 0.9999828934669495, 0.005061050411313772, 0.9999871850013733, 0.00438269367441535, 0.9999904036521912, 0.0037952593993395567, 0.9999927878379822, 0.003286561230197549, 0.9999945759773254, 0.002846046118065715, 0.9999959468841553, 0.0024645752273499966, 0.9999969601631165, 0.002134234644472599, 0.9999977350234985, 0.0018481714650988579, 0.9999982714653015, 0.001600450836122036, 0.9999987483024597, 0.0013859334867447615, 0.9999990463256836, 0.0012001689756289124, 0.9999992847442627, 0.001039303606376052, 0.999999463558197], [-0.5440211296081543, -0.83907151222229, 0.6926341652870178, -0.7212890386581421, 0.9376327395439148, 0.3476274311542511, 0.20907700061798096, 0.9778991937637329, -0.6129367351531982, 0.7901319861412048, -0.9876559972763062, 0.15663856267929077, -0.8797672390937805, -0.47540467977523804, -0.4883069396018982, -0.8726719617843628, -0.02068353071808815, -0.9997860789299011, 0.39233893156051636, -0.9198207259178162, 0.6962924003601074, -0.7177582383155823, 0.88573157787323, -0.4641977846622467, 0.978552520275116, -0.20599761605262756, 0.9995235800743103, 0.0308648981153965, 0.9719821214675903, 0.23505474627017975, 0.9147068858146667, 0.40411797165870667, 0.8414709568023682, 0.5403022766113281, 0.7617204189300537, 0.6479058861732483, 0.6815613508224487, 0.7317609786987305, 0.6046940088272095, 0.7964578866958618, 0.5331684350967407, 0.8460091352462769, 0.4679480791091919, 0.8837559819221497, 0.40930891036987305, 0.9123958349227905, 0.35711193084716797, 0.934061586856842, 0.3109835982322693, 0.9504152536392212, 0.2704322338104248, 0.9627389907836914, 0.23492108285427094, 0.9720144271850586, 0.20391227304935455, 0.9789891839027405, 0.17689219117164612, 0.9842302203178406, 0.1533847451210022, 0.9881665706634521, 0.13295726478099823, 0.991121768951416, 0.11522171646356583, 0.9933397769927979, 0.0998334139585495, 0.9950041770935059, 0.08648823946714401, 0.9962528944015503, 0.07491915673017502, 0.9971895813941956, 0.06489253044128418, 0.9978922605514526, 0.05620449781417847, 0.9984192848205566, 0.048677507787942886, 0.9988145232200623, 0.04215715453028679, 0.999110996723175, 0.03650929778814316, 0.9993333220481873, 0.031617507338523865, 0.999500036239624, 0.027380773797631264, 0.9996250867843628, 0.023711513727903366, 0.9997188448905945, 0.020533807575702667, 0.9997891783714294, 0.017781857401132584, 0.9998418688774109, 0.015398656949400902, 0.9998814463615417, 0.013334819115698338, 0.9999110698699951, 0.011547563597559929, 0.9999333024024963, 0.009999833069741726, 0.9999499917030334, 0.008659535087645054, 0.9999625086784363, 0.007498872000724077, 0.999971866607666, 0.006493770517408848, 0.9999788999557495, 0.0056233834475278854, 0.9999842047691345, 0.0048696561716496944, 0.9999881386756897, 0.0042169527150690556, 0.9999911189079285, 0.0036517330445349216, 0.9999933242797852, 0.003162272274494171, 0.9999949932098389, 0.0027384161949157715, 0.9999962449073792, 0.002371371490880847, 0.9999971985816956, 0.0020535236690193415, 0.9999979138374329, 0.00177827849984169, 0.9999983906745911, 0.0015399259282276034, 0.9999988079071045, 0.0013335209805518389, 0.9999991059303284, 0.00115478178486228, 0.9999993443489075], [-0.9999902248382568, 0.004425697959959507, -0.1006588339805603, -0.9949210286140442, 0.9230524897575378, -0.3846740424633026, 0.7578508257865906, 0.6524279117584229, -0.09727665781974792, 0.9952573776245117, -0.7995481491088867, 0.6006019711494446, -0.9972833395004272, -0.07366066426038742, -0.7677503228187561, -0.6407490968704224, -0.33057501912117004, -0.943779706954956, 0.12897081673145294, -0.9916483759880066, 0.5081897377967834, -0.8612451553344727, 0.7724660038948059, -0.6350561380386353, 0.9266815781593323, -0.37584736943244934, 0.9924299716949463, -0.12281201034784317, 0.9946048855781555, 0.1037357896566391, 0.955177903175354, 0.2960323691368103, 0.8912073373794556, 0.4535961151123047, 0.8149023652076721, 0.5795982480049133, 0.7344688177108765, 0.6786424517631531, 0.6551036238670349, 0.7555390000343323, 0.5798751711845398, 0.8147053122520447, 0.5104123950004578, 0.8599297404289246, 0.447409063577652, 0.8943294286727905, 0.39097580313682556, 0.9204009771347046, 0.34087786078453064, 0.9401075839996338, 0.2966913878917694, 0.9549733996391296, 0.25790295004844666, 0.9661708474159241, 0.2239716500043869, 0.9745956659317017, 0.19436566531658173, 0.9809291362762451, 0.1685830056667328, 0.9856874346733093, 0.14616186916828156, 0.9892606735229492, 0.12668468058109283, 0.9919430613517761, 0.10977829992771149, 0.9939560890197754, 0.09511208534240723, 0.9954665899276733, 0.08239484578371048, 0.9965997934341431, 0.07137124985456467, 0.9974498152732849, 0.06181810423731804, 0.9980874061584473, 0.05354081466794014, 0.998565673828125, 0.04636998102068901, 0.9989243149757385, 0.04015835374593735, 0.9991933107376099, 0.034778039902448654, 0.9993950724601746, 0.0301180612295866, 0.9995463490486145, 0.026082152500748634, 0.9996597766876221, 0.022586854174733162, 0.9997448921203613, 0.0195598267018795, 0.999808669090271, 0.016938380897045135, 0.9998565316200256, 0.014668209478259087, 0.9998924136161804, 0.012702260166406631, 0.9999192953109741, 0.010999778285622597, 0.999939501285553, 0.009525463916361332, 0.9999546408653259, 0.008248742669820786, 0.9999659657478333, 0.0071431370452046394, 0.9999744892120361, 0.006185715086758137, 0.9999808669090271, 0.005356617271900177, 0.9999856352806091, 0.004638644866645336, 0.9999892711639404, 0.004016904626041651, 0.9999919533729553, 0.0034784984309226274, 0.9999939203262329, 0.0030122569296509027, 0.9999954700469971, 0.0026085081044584513, 0.9999966025352478, 0.0022588756401091814, 0.9999974370002747, 0.001956106163561344, 0.9999980926513672, 0.0016939183697104454, 0.9999985694885254, 0.0014668731018900871, 0.999998927116394, 0.001270259846933186, 0.9999991655349731], [-0.5365729331970215, 0.8438539505004883, -0.8230690956115723, -0.5679412484169006, 0.4132748246192932, -0.910606324672699, 0.9981154799461365, 0.06136348098516464, 0.448342889547348, 0.8938616514205933, -0.42555490136146545, 0.9049326181411743, -0.9400671720504761, 0.34098929166793823, -0.9459452629089355, -0.3243263065814972, -0.607683539390564, -0.7941792607307434, -0.14400845766067505, -0.9895764589309692, 0.2916431427001953, -0.9565271735191345, 0.6267400979995728, -0.7792283892631531, 0.8455835580825806, -0.5338431000709534, 0.9618485569953918, -0.2735823392868042, 0.9995669722557068, -0.02942514419555664, 0.9829255938529968, 0.18400348722934723, 0.9320390820503235, 0.3623577654361725, 0.8619772791862488, 0.5069469213485718, 0.7832480072975159, 0.621709406375885, 0.7027516961097717, 0.7114351987838745, 0.6247486472129822, 0.7808259129524231, 0.5516665577888489, 0.834064781665802, 0.48471370339393616, 0.8746728897094727, 0.4243183434009552, 0.9055131077766418, 0.3704313039779663, 0.9288598895072937, 0.32272806763648987, 0.9464917182922363, 0.28073981404304504, 0.9597839117050171, 0.24393658339977264, 0.9697911739349365, 0.2117776721715927, 0.9773178696632385, 0.1837412714958191, 0.982974648475647, 0.1593404859304428, 0.9872236847877502, 0.1381307691335678, 0.990414023399353, 0.11971220374107361, 0.9928086400032043, 0.10372880101203918, 0.9946056008338928, 0.08986590802669525, 0.9959538578987122, 0.0778469517827034, 0.9969653487205505, 0.06742975860834122, 0.9977239966392517, 0.05840285122394562, 0.9982931017875671, 0.05058198794722557, 0.9987199306488037, 0.04380687326192856, 0.9990400075912476, 0.03793822601437569, 0.9992800951004028, 0.03285512328147888, 0.9994601011276245, 0.028452644124627113, 0.9995951652526855, 0.024639805778861046, 0.9996963739395142, 0.021337732672691345, 0.999772310256958, 0.018478065729141235, 0.9998292922973633, 0.01600157469511032, 0.9998719692230225, 0.013856939971446991, 0.9999039769172668, 0.011999712325632572, 0.9999279975891113, 0.010391385294497013, 0.9999459981918335, 0.008998609147965908, 0.9999595284461975, 0.007792500779032707, 0.9999696612358093, 0.006748044863343239, 0.9999772310256958, 0.005843576975166798, 0.9999829530715942, 0.0050603365525603294, 0.9999871850013733, 0.004382075276225805, 0.9999904036521912, 0.0037947241216897964, 0.9999927878379822, 0.003286097664386034, 0.9999945759773254, 0.0028456447180360556, 0.9999959468841553, 0.0024642276111990213, 0.9999969601631165, 0.0021339335944503546, 0.9999977350234985, 0.0018479108111932874, 0.9999982714653015, 0.0016002249903976917, 0.9999987483024597, 0.0013857379090040922, 0.9999990463256836], [0.4201670289039612, 0.9074468016624451, -0.965883731842041, 0.2589760422706604, -0.3182156980037689, -0.9480183124542236, 0.8320630788803101, -0.5546810626983643, 0.8558809757232666, 0.5171728134155273, 0.04737478122115135, 0.9988771677017212, -0.7181434631347656, 0.6958950757980347, -0.9993919134140015, 0.034867603331804276, -0.8245284557342529, -0.5658205151557922, -0.40625593066215515, -0.9137593507766724, 0.05877294763922691, -0.9982714056968689, 0.4546775221824646, -0.8906561136245728, 0.7378162145614624, -0.6750016212463379, 0.9085032343864441, -0.41787782311439514, 0.9867803454399109, -0.1620635986328125, 0.9975802898406982, 0.06952361762523651, 0.9635581970214844, 0.26749882102012634, 0.9025923013687134, 0.4304964244365692, 0.8276246786117554, 0.5612818598747253, 0.7474372982978821, 0.6643323302268982, 0.6676470041275024, 0.7444779872894287, 0.5916127562522888, 0.8062222599983215, 0.5211564898490906, 0.8534611463546753, 0.45709508657455444, 0.889417827129364, 0.3996143341064453, 0.9166833758354187, 0.34852272272109985, 0.9373003244400024, 0.3034188151359558, 0.9528573155403137, 0.26379865407943726, 0.9645777940750122, 0.22912271320819855, 0.9733975529670715, 0.19885598123073578, 0.9800287485122681, 0.17249077558517456, 0.9850111603736877, 0.149558424949646, 0.9887529015541077, 0.12963414192199707, 0.9915618896484375, 0.11233773082494736, 0.9936701059341431, 0.09733191132545471, 0.9952519536018372, 0.08431937545537949, 0.9964388012886047, 0.07303927838802338, 0.99732905626297, 0.06326350569725037, 0.9979968667030334, 0.054793089628219604, 0.998497724533081, 0.04745480790734291, 0.9988734126091003, 0.041098032146692276, 0.9991551041603088, 0.035591937601566315, 0.9993664026260376, 0.03082297556102276, 0.9995248317718506, 0.026692654937505722, 0.9996436834335327, 0.023115573450922966, 0.9997327923774719, 0.020017707720398903, 0.9997996091842651, 0.017334910109639168, 0.9998497366905212, 0.015011602081358433, 0.9998873472213745, 0.012999634258449078, 0.9999154806137085, 0.011257298290729523, 0.9999366402626038, 0.009748470038175583, 0.999952495098114, 0.008441860787570477, 0.9999643564224243, 0.007310372311621904, 0.9999732971191406, 0.006330535747110844, 0.9999799728393555, 0.005482027307152748, 0.9999849796295166, 0.00474724592640996, 0.9999887347221375, 0.004110949579626322, 0.9999915361404419, 0.003559937933459878, 0.9999936819076538, 0.0030827808659523726, 0.999995231628418, 0.0026695793494582176, 0.9999964237213135, 0.0023117612581700087, 0.9999973177909851, 0.0020019032526761293, 0.9999979734420776, 0.0017335769953206182, 0.9999985098838806, 0.0015012159710749984, 0.9999988675117493], [0.9906073808670044, 0.13673721253871918, -0.4285344183444977, 0.9035254716873169, -0.8789904713630676, -0.4768393039703369, 0.3272908926010132, -0.9449236392974854, 0.9998233318328857, -0.018795812502503395, 0.5092903971672058, 0.8605947494506836, -0.3703950345516205, 0.9288743138313293, -0.9210419654846191, 0.38946330547332764, -0.95960533618927, -0.28134962916374207, -0.6382284164428711, -0.76984703540802, -0.1773868352174759, -0.9841412305831909, 0.2635086476802826, -0.9646570086479187, 0.6067785620689392, -0.794870913028717, 0.8336564302444458, -0.5522834062576294, 0.9564719200134277, -0.2918243706226349, 0.9989468455314636, -0.04588233679533005, 0.9854497313499451, 0.1699671447277069, 0.936443030834198, 0.3508196771144867, 0.8673495054244995, 0.497699499130249, 0.7889721393585205, 0.6144289970397949, 0.7084347009658813, 0.7057763934135437, 0.6301563382148743, 0.7764682769775391, 0.5566726922988892, 0.8307319283485413, 0.4892623722553253, 0.872136652469635, 0.4283978044986725, 0.9035902619361877, 0.3740560710430145, 0.9274060726165771, 0.325927197933197, 0.9453948736190796, 0.2835494875907898, 0.9589576125144958, 0.2463953047990799, 0.9691694378852844, 0.21392352879047394, 0.9768503904342651, 0.18561038374900818, 0.9826233983039856, 0.16096614301204681, 0.9869599342346191, 0.13954311609268188, 0.9902160167694092, 0.120938241481781, 0.9926600456237793, 0.10479243844747543, 0.9944941401481628, 0.09078824520111084, 0.9958702325820923, 0.07864648103713989, 0.996902585029602, 0.06812265515327454, 0.9976769685745239, 0.05900322273373604, 0.9982578158378601, 0.051102109253406525, 0.9986934065818787, 0.044257424771785736, 0.9990201592445374, 0.03832848370075226, 0.999265193939209, 0.033193133771419525, 0.9994489550590515, 0.028745390474796295, 0.9995867609977722, 0.024893339723348618, 0.9996901154518127, 0.02155730128288269, 0.9997676014900208, 0.018668215721845627, 0.9998257160186768, 0.016166243702173233, 0.9998693466186523, 0.013999542221426964, 0.9999020099639893, 0.012123203836381435, 0.9999265074729919, 0.010498326271772385, 0.9999448657035828, 0.009091218002140522, 0.9999586939811707, 0.007872696965932846, 0.9999690055847168, 0.0068174926564097404, 0.9999767541885376, 0.005903716664761305, 0.9999825954437256, 0.00511241564527154, 0.9999869465827942, 0.0044271741062402725, 0.9999902248382568, 0.003833778202533722, 0.9999926686286926, 0.0033199170138686895, 0.9999945163726807, 0.002874931087717414, 0.9999958872795105, 0.002489588689059019, 0.9999969005584717, 0.0021558955777436495, 0.9999976754188538, 0.0018669288838282228, 0.9999982714653015, 0.0016166940331459045, 0.9999986886978149], [0.6502878665924072, -0.7596879005432129, 0.41058382391929626, 0.9118228554725647, -0.9682061672210693, 0.2501535713672638, -0.31071627140045166, -0.9505026936531067, 0.8358383178710938, -0.5489757061004639, 0.8528020977973938, 0.5222342610359192, 0.042249664664268494, 0.9991070628166199, -0.7212279438972473, 0.6926978230476379, -0.9995186924934387, 0.031022531911730766, -0.8226388692855835, -0.5685642957687378, -0.40361806750297546, -0.9149275422096252, 0.06126672029495239, -0.998121440410614, 0.4566033184528351, -0.8896703720092773, 0.7390795350074768, -0.6736181974411011, 0.9091799855232239, -0.4164033830165863, 0.9870070219039917, -0.16067712008953094, 0.9974949955940247, 0.07073719799518585, 0.9632758498191833, 0.2685137987136841, 0.9021991491317749, 0.4313196837902069, 0.8271810412406921, 0.561935544013977, 0.7469826340675354, 0.6648435592651367, 0.6672058701515198, 0.7448734045028687, 0.5911991000175476, 0.8065256476402283, 0.5207772850990295, 0.8536925911903381, 0.45675286650657654, 0.8895936012268066, 0.3993089199066162, 0.9168164134025574, 0.3482522964477539, 0.9374008178710938, 0.3031807541847229, 0.9529330730438232, 0.2635899782180786, 0.9646348357200623, 0.22894035279750824, 0.9734404683113098, 0.19869698584079742, 0.9800609946250916, 0.1723523885011673, 0.9850353598594666, 0.14943812787532806, 0.9887710809707642, 0.1295296847820282, 0.9915755391120911, 0.11224707961082458, 0.9936802983283997, 0.09725328534841537, 0.9952596426010132, 0.08425120264291763, 0.9964445233345032, 0.07298018783330917, 0.9973334074020386, 0.0632123053073883, 0.9980000853538513, 0.05474873259663582, 0.9985001683235168, 0.04741637781262398, 0.9988752007484436, 0.04106474295258522, 0.9991564750671387, 0.03556310385465622, 0.9993674159049988, 0.03079800494015217, 0.9995256066322327, 0.026671027764678, 0.9996442794799805, 0.02309684455394745, 0.9997332096099854, 0.0200014878064394, 0.9997999668121338, 0.017320863902568817, 0.9998499751091003, 0.014999437145888805, 0.9998875260353088, 0.012989099137485027, 0.9999156594276428, 0.011248175986111164, 0.9999367594718933, 0.009740570560097694, 0.9999525547027588, 0.008435020223259926, 0.9999644160270691, 0.007304447703063488, 0.9999732971191406, 0.006325405556708574, 0.9999799728393555, 0.005477584432810545, 0.9999849796295166, 0.004743398632854223, 0.9999887347221375, 0.004107617773115635, 0.9999915361404419, 0.0035570531617850065, 0.9999936819076538, 0.0030802825931459665, 0.999995231628418, 0.002667415887117386, 0.9999964237213135, 0.002309887669980526, 0.9999973177909851, 0.002000280888751149, 0.9999979734420776, 0.0017321720952168107, 0.9999985098838806], [-0.2879033088684082, -0.9576594829559326, 0.9605737328529358, 0.2780253291130066, -0.5380005240440369, 0.8429445028305054, -0.8222357034683228, -0.5691471099853516, 0.41443032026290894, -0.9100810289382935, 0.998047411441803, 0.06246054545044899, 0.447491854429245, 0.8942880034446716, -0.42630067467689514, 0.9045815467834473, -0.9403103590011597, 0.3403182029724121, -0.9457446336746216, -0.3249109387397766, -0.6072583794593811, -0.7945044040679932, -0.14354975521564484, -0.9896430969238281, 0.2920270562171936, -0.9564100503921509, 0.6270108819007874, -0.7790104746818542, 0.8457441926002502, -0.5335885286331177, 0.9619198441505432, -0.2733316123485565, 0.9995735883712769, -0.029199521988630295, 0.9828895926475525, 0.1841956079006195, 0.9319777488708496, 0.36251550912857056, 0.8619029521942139, 0.5070732831954956, 0.7831690907478333, 0.6218088269233704, 0.7026734948158264, 0.7115124464035034, 0.6246743202209473, 0.7808853983879089, 0.5515977740287781, 0.8341102004051208, 0.48465126752853394, 0.8747074604034424, 0.4242623448371887, 0.905539333820343, 0.37038159370422363, 0.9288796782493591, 0.3226841688156128, 0.946506679058075, 0.28070130944252014, 0.9597951769828796, 0.24390287697315216, 0.9697996377944946, 0.21174825727939606, 0.9773242473602295, 0.18371565639972687, 0.982979416847229, 0.159318208694458, 0.9872272610664368, 0.138111412525177, 0.9904167056083679, 0.11969540268182755, 0.9928106665611267, 0.103714220225811, 0.994607150554657, 0.08985326439142227, 0.9959549903869629, 0.07783599197864532, 0.9969661831855774, 0.06742025911808014, 0.9977246522903442, 0.058394622057676315, 0.9982935786247253, 0.050574857741594315, 0.9987202882766724, 0.04380069673061371, 0.9990403056144714, 0.037932876497507095, 0.9992802739143372, 0.032850489020347595, 0.9994602799415588, 0.02844863198697567, 0.9995952844619751, 0.02463633194565773, 0.9996964931488037, 0.021334724500775337, 0.9997723698616028, 0.01847545988857746, 0.9998292922973633, 0.015999317169189453, 0.9998720288276672, 0.013854986056685448, 0.9999040365219116, 0.011998019181191921, 0.9999279975891113, 0.010389919392764568, 0.9999459981918335, 0.008997339755296707, 0.9999595284461975, 0.007791401352733374, 0.9999696612358093, 0.006747093051671982, 0.9999772310256958, 0.005842752754688263, 0.9999829530715942, 0.005059622693806887, 0.9999871850013733, 0.004381457343697548, 0.9999904036521912, 0.003794188844040036, 0.9999927878379822, 0.003285634098574519, 0.9999945759773254, 0.0028452433180063963, 0.9999959468841553, 0.002463879995048046, 0.9999969601631165, 0.0021336327772587538, 0.9999977350234985, 0.0018476501572877169, 0.9999982714653015], [-0.9613974690437317, -0.27516335248947144, 0.8341389298439026, -0.5515543818473816, 0.18083064258098602, 0.9835142493247986, -0.9990359544754028, 0.04389933869242668, -0.13461466133594513, -0.9908980131149292, 0.9112586379051208, -0.4118345081806183, 0.7743297815322876, 0.6327822804450989, -0.07515421509742737, 0.997171938419342, -0.7878519296646118, 0.6158646941184998, -0.9983716011047363, -0.057044617831707, -0.7769097685813904, -0.6296119689941406, -0.3423340320587158, -0.9395782947540283, 0.11824039369821548, -0.9929850101470947, 0.5001028776168823, -0.8659660220146179, 0.7672910094261169, -0.6412990689277649, 0.9240195751190186, -0.3823452293872833, 0.9916648268699646, -0.1288444995880127, 0.9951373338699341, 0.09849701076745987, 0.9565178751945496, 0.2916737198829651, 0.8929915428161621, 0.4500734210014343, 0.8168795704841614, 0.5768082737922668, 0.7364751696586609, 0.6764645576477051, 0.6570388674736023, 0.7538566589355469, 0.5816828608512878, 0.8134157061576843, 0.5120649933815002, 0.858946681022644, 0.44889765977859497, 0.8935831785202026, 0.39230260252952576, 0.9198362231254578, 0.34205153584480286, 0.9396811723709106, 0.2977238595485687, 0.9546520113945007, 0.25880756974220276, 0.9659289121627808, 0.22476187348365784, 0.9744137525558472, 0.19505442678928375, 0.9807924032211304, 0.16918234527111053, 0.9855847954750061, 0.1466827690601349, 0.9891836047172546, 0.1271369904279709, 0.9918851852416992, 0.11017078161239624, 0.9939126968383789, 0.09545248001813889, 0.9954339861869812, 0.08268995583057404, 0.9965752959251404, 0.07162702083587646, 0.9974314570426941, 0.062039732933044434, 0.9980736970901489, 0.05373283103108406, 0.9985553622245789, 0.046536318957805634, 0.9989166259765625, 0.04030243307352066, 0.9991875290870667, 0.03490283340215683, 0.999390721321106, 0.030226144939661026, 0.9995430707931519, 0.026175761595368385, 0.9996573328971863, 0.02266792207956314, 0.9997430443763733, 0.019630033522844315, 0.9998072981834412, 0.016999181360006332, 0.9998555183410645, 0.014720861800014973, 0.9998916387557983, 0.012747855857014656, 0.9999187588691711, 0.01103926356881857, 0.9999390840530396, 0.009559656493365765, 0.9999542832374573, 0.00827835313975811, 0.9999657273292542, 0.007168779149651527, 0.9999743103981018, 0.006207920145243406, 0.9999807476997375, 0.005375846289098263, 0.9999855756759644, 0.004655296448618174, 0.9999891519546509, 0.004031324293464422, 0.9999918937683105, 0.003490985371172428, 0.9999939203262329, 0.0030230702832341194, 0.9999954104423523, 0.0026178720872849226, 0.9999966025352478, 0.0022669844329357147, 0.9999974370002747, 0.001963128102943301, 0.9999980926513672], [-0.7509872317314148, 0.6603167057037354, 0.12031327933073044, -0.9927359819412231, 0.8026500940322876, 0.59645015001297, -0.7691444158554077, 0.6390750408172607, -0.642200767993927, -0.7665364742279053, 0.6126131415367126, -0.7903829216957092, 0.965498685836792, 0.26040780544281006, 0.28590333461761475, 0.9582584500312805, -0.5572627186775208, 0.8303362727165222, -0.9765980243682861, 0.21507278084754944, -0.9030765891075134, -0.4294794797897339, -0.526732861995697, -0.8500308990478516, -0.05927551910281181, -0.998241662979126, 0.3613589406013489, -0.9324268102645874, 0.6752134561538696, -0.7376223802566528, 0.873810887336731, -0.4862658679485321, 0.9738476276397705, -0.22720208764076233, 0.999927282333374, 0.012060252018272877, 0.9756816625595093, 0.2191924899816513, 0.9203157424926758, 0.3911762833595276, 0.8480075001716614, 0.5299842357635498, 0.7685307264328003, 0.6398128867149353, 0.6882352232933044, 0.7254875898361206, 0.6109922528266907, 0.79163658618927, 0.5389667749404907, 0.8423270583152771, 0.4731963574886322, 0.8809570074081421, 0.41400301456451416, 0.9102755188941956, 0.3612746596336365, 0.9324594736099243, 0.3146522641181946, 0.9492070078849792, 0.2736508846282959, 0.9618290662765503, 0.23773550987243652, 0.971329927444458, 0.20636717975139618, 0.9784746170043945, 0.17902956902980804, 0.9838436841964722, 0.1552431434392929, 0.987876296043396, 0.13457144796848297, 0.990903913974762, 0.11662270128726959, 0.993176281452179, 0.10104867815971375, 0.9948815107345581, 0.08754195272922516, 0.9961608052253723, 0.07583250105381012, 0.9971205592155457, 0.06568402051925659, 0.9978404641151428, 0.05689026415348053, 0.9983804225921631, 0.0492715947329998, 0.9987854361534119, 0.04267176613211632, 0.9990891218185425, 0.036955032497644424, 0.999316930770874, 0.03200356289744377, 0.9994877576828003, 0.027715127915143967, 0.9996158480644226, 0.02400108054280281, 0.9997119307518005, 0.02078457921743393, 0.999783992767334, 0.01799902878701687, 0.9998379945755005, 0.015586726367473602, 0.9998785257339478, 0.013497686013579369, 0.9999089241027832, 0.011688603088259697, 0.9999316930770874, 0.010121971368789673, 0.9999487996101379, 0.008765303529798985, 0.9999615550041199, 0.007590464316308498, 0.9999712109565735, 0.006573087070137262, 0.9999784231185913, 0.005692068953067064, 0.9999837875366211, 0.004929135553538799, 0.9999878406524658, 0.004268459510058165, 0.9999908804893494, 0.003696336643770337, 0.9999931454658508, 0.003200897481292486, 0.9999948740005493, 0.002771864179521799, 0.9999961853027344, 0.0024003363214433193, 0.9999971389770508, 0.0020786060485988855, 0.9999978542327881], [0.14987720549106598, 0.9887046217918396, -0.6782355904579163, -0.7348445653915405, 0.993865430355072, -0.11059632897377014, -0.22614625096321106, 0.9740933775901794, -0.9520007371902466, -0.3060956597328186, 0.17154231667518616, -0.9851767420768738, 0.9875043034553528, -0.15759222209453583, 0.6092568635940552, 0.7929729223251343, -0.2714100182056427, 0.9624637961387634, -0.8820464015007019, 0.4711625576019287, -0.9786972999572754, -0.20530852675437927, -0.6889974474906921, -0.7247637510299683, -0.2349219024181366, -0.9720142483711243, 0.21406276524066925, -0.9768199324607849, 0.571146547794342, -0.8208481073379517, 0.8119627833366394, -0.5837092399597168, 